app/controllers/certs_controller.rb

SELECT "certs".* FROM "certs"
---
  def index
    @certs = Cert.all

INSERT INTO "certs" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "ojo"], ["body", "jojo"], ["created_at", "2018-02-12 21:05:32.717593"], ["updated_at", "2018-02-12 21:05:32.717593"]]
---
  def create
    @cert = Cert.new(cert_params)

    respond_to do |format|
      if @cert.save

UPDATE "certs" SET "image" = $1, "updated_at" = $2 WHERE "certs"."id" = $3  [["image", "gris.jpg"], ["updated_at", "2018-02-12 20:58:13.702243"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @cert.update(cert_params)

DELETE FROM "certs" WHERE "certs"."id" = $1  [["id", 4]]
---
  def destroy
    @cert.destroy

SELECT  "certs".* FROM "certs" WHERE "certs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_cert
      @cert = Cert.find(params[:id])