app/controllers/cults_controller.rb

SELECT "cults".* FROM "cults"
---
  def index
    @cults = Cult.all

INSERT INTO "cults" ("title", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "parcelas de quinta"], ["image", "9321397_orig.jpg"], ["created_at", "2017-07-29 17:02:42.033054"], ["updated_at", "2017-07-29 17:02:42.033054"]]
---
  def create
    @cult = Cult.new(cult_params)

    respond_to do |format|
      if @cult.save

DELETE FROM "cults" WHERE "cults"."id" = $1  [["id", 4]]
---
  def destroy
    @cult.destroy

SELECT  "cults".* FROM "cults" WHERE "cults"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
    def set_cult
      @cult = Cult.find(params[:id])