app/controllers/pros_controller.rb

  def index
    @pros = Pro.all
---
SELECT "pros".* FROM "pros"

  def create
    @pro = Pro.new(pro_params)

    respond_to do |format|
      if @pro.save
---
INSERT INTO "pros" ("title", "body", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Quinua Blanca"], ["body", "White Quinoa"], ["image", "quinua.jpg"], ["created_at", "2017-07-29 15:22:39.694845"], ["updated_at", "2017-07-29 15:22:39.694845"]]

  def destroy
    @pro.destroy
---
DELETE FROM "pros" WHERE "pros"."id" = $1  [["id", 1]]

    def set_pro
      @pro = Pro.find(params[:id])
---
SELECT  "pros".* FROM "pros" WHERE "pros"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]